sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_i2c_slave.c
/****************************************************************************
 * arch/risc-v/src/esp32p4/espressif/esp_i2c_slave.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include <nuttx/kmalloc.h>
#include <nuttx/spinlock.h>

#ifdef CONFIG_ESPRESSIF_I2C_PERIPH_SLAVE_MODE

#include <sys/types.h>
#include <stdio.h>
#include <stdlib.h>
#include <stdint.h>
#include <stdbool.h>
#include <assert.h>
#include <errno.h>
#include <debug.h>
#include <time.h>
#include <sys/time.h>
#include <sys/param.h>

#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <nuttx/clock.h>
#include <nuttx/signal.h>
#include <nuttx/mutex.h>
#include <nuttx/semaphore.h>
#include <nuttx/i2c/i2c_slave.h>
#include <nuttx/kthread.h>
#include <arch/board/board.h>

#include "esp_i2c_slave.h"
#include "esp_irq.h"
#include "esp_gpio.h"
#include "riscv_internal.h"

#include "periph_ctrl.h"
#include "hal/i2c_hal.h"
#include "hal/i2c_types.h"
#include "hal/i2c_ll.h"
#include "soc/system_reg.h"
#include "soc/gpio_sig_map.h"
#include "hal/i2c_periph.h"
#if defined(CONFIG_ARCH_CHIP_ESP32H2) || defined(CONFIG_ARCH_CHIP_ESP32C6)
#  include "soc/pcr_reg.h"
#endif
#ifdef CONFIG_PM
#  include "include/esp_pm.h"
#endif

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define I2C_FIFO_FULL_THRESH_VAL      28
#define I2C_FIFO_EMPTY_THRESH_VAL     5
#define I2C_SLAVE_TIMEOUT_DEFAULT     32000                /* I2C slave timeout value, APB clock cycle number */
#define I2C_SLAVE_SDA_SAMPLE_DEFAULT  10                   /* I2C slave sample time after scl positive edge default value */
#define I2C_SLAVE_SDA_HOLD_DEFAULT    10                   /* I2C slave hold time after scl negative edge default value */
#define I2C_SLAVE_BUFF_SIZE           1024
#ifdef CONFIG_I2C_POLLED
#define I2C_SLAVE_POLL_RATE           10
#endif

#if SOC_PERIPH_CLK_CTRL_SHARED
#define I2C_CLOCK_SRC_ATOMIC() PERIPH_RCC_ATOMIC()
#else
#define I2C_CLOCK_SRC_ATOMIC()
#endif

#if !SOC_RCC_IS_INDEPENDENT
#  define I2C_RCC_ATOMIC() PERIPH_RCC_ATOMIC()
#else
#  define I2C_RCC_ATOMIC()
#endif

#define SCL_PIN_ATTR (FUNCTION_2 | INPUT_PULLUP)
#define SDA_PIN_ATTR (FUNCTION_2 | INPUT_PULLUP | OUTPUT_OPEN_DRAIN)

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* I2C Device hardware configuration */

struct esp_i2c_config_s
{
  uint8_t scl_pin;      /* GPIO configuration for SCL as SCL */
  uint8_t sda_pin;      /* GPIO configuration for SDA as SDA */
};

/* I2C Device Private Data */

struct esp_i2c_priv_s
{
  const struct i2c_slaveops_s *ops; /* Standard I2C operations */
  uint32_t id;                      /* I2C instance */

  /* Port configuration */

  const struct esp_i2c_config_s *config;
  int refs;                         /* Reference count */
  mutex_t lock;                     /* Mutual exclusion mutex */

#ifndef CONFIG_I2C_POLLED
  int cpuint;                       /* CPU interrupt assigned to this I2C */
#endif

#ifdef CONFIG_I2C_POLLED
  bool enabled;
#endif

  uint32_t error;                         /* I2C transform error */
  i2c_hal_context_t *ctx;                 /* Common layer struct */
  int addr;                               /* Slave device address */
  int nbits;                              /* Slave device address bit count */
  i2c_slave_callback_t *cb;               /* Callback function when interrupt happens */
  void *cb_arg;                           /* Argument of callback function */
  uint32_t tx_length;                     /* Location of next TX value */
  uint8_t tx_buffer[I2C_SLAVE_BUFF_SIZE]; /* I2C Slave TX queue buffer */
  uint32_t rx_length;                     /* Location of next RX value */
  uint8_t rx_buffer[I2C_SLAVE_BUFF_SIZE]; /* I2C Slave RX queue buffer */
#ifdef CONFIG_PM
  esp_pm_lock_handle_t pm_lock;           /* Power management lock */
#endif
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int esp_i2c_slave_setownaddress(struct i2c_slave_s *dev, int addr,
                                       int nbits);
static int esp_i2c_slave_write(struct i2c_slave_s *dev,
                               const uint8_t *buffer, int buflen);
static int esp_i2c_slave_read(struct i2c_slave_s *dev,
                              uint8_t *buffer, int buflen);
static int esp_i2c_slave_registercallback(struct i2c_slave_s *dev,
                                          i2c_slave_callback_t *callback,
                                          void *arg);
static void esp_i2c_slave_intr_disable(struct esp_i2c_priv_s *priv);
static void esp_i2c_slave_init(struct esp_i2c_priv_s *priv);
static void esp_i2c_slave_deinit(struct esp_i2c_priv_s *priv);
#ifndef CONFIG_I2C_POLLED
static int esp_i2c_slave_irq(int cpuint, void *context, void *arg);
#endif
#ifdef CONFIG_I2C_POLLED
static int esp_i2c_slave_polling_waitdone(struct esp_i2c_priv_s *priv);
#endif /* CONFIG_I2C_POLLED */
static inline void esp_i2c_process(struct esp_i2c_priv_s *priv,
                                   uint32_t irq_status);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* I2C interface */

static const struct i2c_slaveops_s esp_i2c_ops =
{
  .setownaddress    = esp_i2c_slave_setownaddress,
  .write            = esp_i2c_slave_write,
  .read             = esp_i2c_slave_read,
  .registercallback = esp_i2c_slave_registercallback,
};

#ifdef CONFIG_ESPRESSIF_I2C0_SLAVE_MODE

i2c_hal_context_t i2c0_ctx =
{
  0
};

/* I2C device structure */

static const struct esp_i2c_config_s esp_i2c0_config =
{
  .scl_pin    = CONFIG_ESPRESSIF_I2C0_SCLPIN,
  .sda_pin    = CONFIG_ESPRESSIF_I2C0_SDAPIN,
};

