sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_i2c_slave.c
static struct esp_i2c_priv_s esp_i2c0_priv =
{
  .ops        = &esp_i2c_ops,
  .id         = 0,
  .config     = &esp_i2c0_config,
  .refs       = 0,
  .lock       = NXMUTEX_INITIALIZER,
#ifndef CONFIG_I2C_POLLED
  .cpuint     = -ENOMEM,
#endif

#ifdef CONFIG_I2C_POLLED
  .enabled    = false,
#endif

  .error      = 0,
  .ctx        = &i2c0_ctx,
  .addr       = 0,
  .nbits      = 0,
  .cb         = NULL,
  .cb_arg     = NULL,
  .tx_length  = 0,
  .tx_buffer  =
  {
    0
  },
  .rx_length  = 0,
  .rx_buffer  =
  {
    0
  },
#ifdef CONFIG_PM
  .pm_lock    = NULL,
#endif
};
#endif

#ifdef CONFIG_ESPRESSIF_I2C1_SLAVE_MODE

i2c_hal_context_t i2c1_ctx =
{
  0
};

/* I2C device structure */

static const struct esp_i2c_config_s esp_i2c1_config =
{
  .scl_pin    = CONFIG_ESPRESSIF_I2C1_SCLPIN,
  .sda_pin    = CONFIG_ESPRESSIF_I2C1_SDAPIN,
};

static struct esp_i2c_priv_s esp_i2c1_priv =
{
  .ops        = &esp_i2c_ops,
  .id         = 1,
  .config     = &esp_i2c1_config,
  .refs       = 0,
  .lock       = NXMUTEX_INITIALIZER,
#ifndef CONFIG_I2C_POLLED
  .cpuint     = -ENOMEM,
#endif

#ifdef CONFIG_I2C_POLLED
  .enabled    = false,
#endif

  .error      = 0,
  .ctx        = &i2c1_ctx,
  .addr       = 0,
  .nbits      = 0,
  .cb         = NULL,
  .cb_arg     = NULL,
  .tx_length  = 0,
  .tx_buffer  =
  {
    0
  },
  .rx_length  = 0,
  .rx_buffer  =
  {
    0
  },
#ifdef CONFIG_PM
  .pm_lock    = NULL,
#endif
};
#endif /* CONFIG_ESPRESSIF_I2C1 */

/****************************************************************************
 * Public Data
 ****************************************************************************/

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp_i2c_slave_setownaddress
 *
 * Description:
 *   Set our own I2C address.
 *
 *   One may register a callback to be notified about reception. During the
 *   slave mode reception, the methods READ and WRITE must be used to
 *   to handle reads and writes from a master.
 *
 * Input Parameters:
 *   dev     - I2C slave device-specific state data
 *   address - Our own slave address
 *   nbits   - The number of address bits provided (7 or 10)
 *
 * Returned Value:
 *   OK when successful, or a negated errno when there is an error.
 *
 ****************************************************************************/

static int esp_i2c_slave_setownaddress(struct i2c_slave_s *dev, int addr,
                                       int nbits)
{
  struct esp_i2c_priv_s *priv;
  irqstate_t flags;
  bool extended_addr = false;

  DEBUGASSERT(dev);
  priv = (struct esp_i2c_priv_s *)dev;
  flags = enter_critical_section();

  if (priv->addr == addr && priv->nbits == nbits)
    {
      leave_critical_section(flags);
      return OK;
    }

  switch (nbits)
    {
      case 7:
        {
          priv->addr = addr & 0x7f;
          priv->nbits = 7;
        }
        break;

      case 10:
        {
          priv->addr = addr & 0x3ff;
          priv->nbits = 10;
          extended_addr = true;
        }
        break;

      default:
        {
          leave_critical_section(flags);
          return ERROR;
        }
        break;
    }

  i2c_ll_set_slave_addr(priv->ctx->dev, priv->addr, extended_addr);
  i2c_ll_update(priv->ctx->dev);

  leave_critical_section(flags);

  return OK;
}

/****************************************************************************
 * Name: esp_i2c_slave_write
 *
 * Description:
 *   Send a block of data on I2C when a bus master wants to read data from
 *   this particular device.
 *
 * Input Parameters:
 *   dev    - I2C slave device-specific state data
 *   buffer - A pointer to the read-only buffer of data to be written to the
 *            device
 *   buflen - The number of bytes to send from the buffer
 *
 * Returned Value:
 *   Returns the number of items written to the I2C memory.
 *
 ****************************************************************************/

static int esp_i2c_slave_write(struct i2c_slave_s *dev,
                               const uint8_t *buffer, int buflen)
{
  struct esp_i2c_priv_s *priv = (struct esp_i2c_priv_s *)dev;
  irqstate_t flags = enter_critical_section();
  int cnt = buflen;
#ifdef CONFIG_I2C_POLLED
  int ret;
#endif

  /* Update the registered buffer and length */

  cnt = MIN(I2C_SLAVE_BUFF_SIZE - priv->tx_length, buflen);
  memcpy(priv->tx_buffer + priv->tx_length, buffer, cnt);
  priv->tx_length += cnt;

  if (priv->tx_length > 0)
    {
      i2c_ll_slave_enable_tx_it(priv->ctx->dev);
    }

#ifdef CONFIG_I2C_POLLED
  ret = esp_i2c_slave_polling_waitdone(priv);
  if (ret < 0)
    {
      cnt = ret;
    }
#endif

  leave_critical_section(flags);
  return cnt;
}

/****************************************************************************
 * Name: esp_i2c_slave_read
 *
 * Description:
 *   Receive a block of data from I2C when a bus master writes data addressed
 *   to this particular device.
 *
 * Input Parameters:
 *   dev    - I2C slave device-specific state data
 *   buffer - A pointer to a buffer of data to receive the data from the
 *            device
 *   buflen - The maximum size of the buffer
 *
 * Returned Value:
 *   OK when successful, or a negated errno when there is an error.
 *
 ****************************************************************************/

static int esp_i2c_slave_read(struct i2c_slave_s *dev,
                              uint8_t *buffer, int buflen)
{
  struct esp_i2c_priv_s *priv = (struct esp_i2c_priv_s *)dev;
  irqstate_t flags = enter_critical_section();
  int read_len = ERROR;

  /* Update the registered buffer and length */

  i2c_ll_slave_enable_rx_it(priv->ctx->dev);

  read_len = MIN(priv->rx_length, buflen);
  memcpy(buffer, priv->rx_buffer, read_len);
  memmove(priv->rx_buffer, priv->rx_buffer + read_len, read_len);
  priv->rx_length -= read_len;

  leave_critical_section(flags);

  return read_len;
}

/****************************************************************************
 * Name: esp_i2c_slave_registercallback
 *
 * Description:
 *   Register a callback function that will be invoked when something is
 *   received on I2C.
 *
 * Input Parameters:
 *   dev      - I2C slave device-specific state data
 *   callback - The function to be called when something has been received.
 *   arg      - User provided argument to be used with the callback
 *
 * Returned Value:
 *   OK when successful, or a negated errno when there is an error.
 *
 ****************************************************************************/

static int esp_i2c_slave_registercallback(struct i2c_slave_s *dev,
                                          i2c_slave_callback_t *callback,
                                          void *arg)
{
  struct esp_i2c_priv_s *priv;
  irqstate_t flags;

  DEBUGASSERT(dev);
  DEBUGASSERT(callback);

  priv = (struct esp_i2c_priv_s *)dev;
  flags = enter_critical_section();

  /* Set callback and callback argument */

  priv->cb = callback;
  priv->cb_arg = arg;

  leave_critical_section(flags);

  return OK;
}

/****************************************************************************
 * Name: esp_i2c_slave_intr_disable
 *
 * Description:
 *   Disable I2C interrupts.
 *
 * Parameters:
 *   priv - Pointer to the internal driver state structure.
 *
 ****************************************************************************/

static void esp_i2c_slave_intr_disable(struct esp_i2c_priv_s *priv)
{
  i2c_ll_disable_intr_mask(priv->ctx->dev, I2C_LL_INTR_MASK);
  i2c_ll_clear_intr_mask(priv->ctx->dev, I2C_LL_INTR_MASK);
}

/****************************************************************************
 * Name: esp_i2c_slave_init
 *
 * Description:
 *   Initialize I2C hardware.
 *
 * Parameters:
 *   priv - Pointer to the internal driver state structure.
 *
 ****************************************************************************/

static void esp_i2c_slave_init(struct esp_i2c_priv_s *priv)
{
  const struct esp_i2c_config_s *config = priv->config;

  uint32_t scl_in_sig = i2c_periph_signal[priv->id].scl_in_sig;
  uint32_t scl_out_sig = i2c_periph_signal[priv->id].scl_out_sig;
  uint32_t sda_in_sig = i2c_periph_signal[priv->id].sda_in_sig;
  uint32_t sda_out_sig = i2c_periph_signal[priv->id].sda_out_sig;

  /* Configure GPIO signals for I2C SCL and SDA pins */

  esp_gpiowrite(config->scl_pin, 1);
  esp_gpiowrite(config->sda_pin, 1);

  esp_configgpio(config->scl_pin, SCL_PIN_ATTR);
  esp_gpio_matrix_in(config->scl_pin, scl_in_sig, 0);

