sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_i2c_slave.c
  esp_configgpio(config->sda_pin, SDA_PIN_ATTR);
  esp_gpio_matrix_out(config->sda_pin, sda_out_sig, 0, 0);
  esp_gpio_matrix_in(config->sda_pin, sda_in_sig, 0);

  /* Enable I2C hardware */

  I2C_RCC_ATOMIC()
    {
      i2c_ll_enable_bus_clock(priv->id, true);
      i2c_ll_reset_register(priv->id);
    }

  I2C_CLOCK_SRC_ATOMIC()
    {
      i2c_hal_init(priv->ctx, priv->id);
    }

  /* Disable I2C interrupts */

  esp_i2c_slave_intr_disable(priv);

  /* Initialize I2C Slave */

  i2c_hal_slave_init(priv->ctx);
  i2c_ll_slave_enable_auto_start(priv->ctx->dev, true);
  I2C_CLOCK_SRC_ATOMIC()
    {
      i2c_ll_set_source_clk(priv->ctx->dev, I2C_CLK_SRC_DEFAULT);
    }

  i2c_ll_set_slave_addr(priv->ctx->dev, priv->addr, false);
  i2c_ll_set_rxfifo_full_thr(priv->ctx->dev, I2C_FIFO_FULL_THRESH_VAL);
  i2c_ll_set_txfifo_empty_thr(priv->ctx->dev, I2C_FIFO_EMPTY_THRESH_VAL);

  /* set timing for data */

  i2c_ll_set_sda_timing(priv->ctx->dev, I2C_SLAVE_SDA_SAMPLE_DEFAULT,
                        I2C_SLAVE_SDA_HOLD_DEFAULT);
  i2c_ll_set_tout(priv->ctx->dev, I2C_SLAVE_TIMEOUT_DEFAULT);
  i2c_ll_slave_enable_rx_it(priv->ctx->dev);

  i2c_ll_update(priv->ctx->dev);
}

/****************************************************************************
 * Name: esp_i2c_slave_deinit
 *
 * Description:
 *   Disable I2C hardware.
 *
 * Parameters:
 *   priv - Pointer to the internal driver state structure.
 *
 ****************************************************************************/

static void esp_i2c_slave_deinit(struct esp_i2c_priv_s *priv)
{
  I2C_CLOCK_SRC_ATOMIC()
    {
      i2c_hal_deinit(priv->ctx);
    }

  I2C_RCC_ATOMIC()
    {
      i2c_ll_enable_bus_clock(priv->id, false);
    }
}

/****************************************************************************
 * Name: esp_i2c_irq
 *
 * Description:
 *   This is the common I2C interrupt handler. It will be invoked when an
 *   interrupt is received on the device.
 *
 * Parameters:
 *   cpuint  - CPU interrupt index
 *   context - Context data from the ISR
 *   arg     - Opaque pointer to the internal driver state structure.
 *
 * Returned Value:
 *   Zero (OK) is returned on success. A negated errno value is returned on
 *   failure.
 *
 ****************************************************************************/
#ifndef CONFIG_I2C_POLLED
static int esp_i2c_slave_irq(int irq, void *context, void *arg)
{
  struct esp_i2c_priv_s *priv = (struct esp_i2c_priv_s *)arg;
  uint32_t irq_status = 0;

  i2c_ll_get_intr_mask(priv->ctx->dev, &irq_status);
  if (irq_status == 0)
    {
      return OK;
    }

#ifdef CONFIG_PM
  esp_pm_lock_acquire(priv->pm_lock);
#endif
  esp_i2c_process(priv , irq_status);
  i2c_ll_clear_intr_mask(priv->ctx->dev, irq_status);
#ifdef CONFIG_PM
  esp_pm_lock_release(priv->pm_lock);
#endif
  return OK;
}
#endif

/****************************************************************************
 * Name: esp_i2c_slave_polling_waitdone
 *
 * Description:
 *   Wait for a transfer to complete by polling status interrupt registers,
 *   which indicates the status of the I2C operations. This function is only
 *   used in polling driven mode.
 *
 * Parameters:
 *   priv - Pointer to the internal driver state structure.
 *
 * Returned Values:
 *   Zero (OK) is returned on successful transfer. -ETIMEDOUT is returned
 *   in case a transfer didn't finish within the timeout interval.
 *
 ****************************************************************************/
#ifdef CONFIG_I2C_POLLED
static int esp_i2c_slave_polling_waitdone(struct esp_i2c_priv_s *priv)
{
  int ret;
  clock_t current;
  clock_t timeout;
  uint32_t status = 0;
  i2c_intr_event_t event = 0;

  current = clock_systime_ticks();
  timeout = current + SEC2TICK(I2C_SLAVE_POLL_RATE);

  while (current - timeout < 0)
    {
      /* Check if any interrupt triggered, clear them
       * process the operation.
       */

      i2c_ll_get_intr_mask(priv->ctx->dev, &status);
      if (status != 0)
        {
          i2c_ll_slave_get_event(priv->ctx->dev, &event);

          esp_i2c_process(priv, status);
          i2c_ll_clear_intr_mask(priv->ctx->dev, status);
        }

      /* Update current time */

      current = clock_systime_ticks();
    }

  if (current >= timeout)
    {
      ret = -ETIMEDOUT;
    }
  else
    {
      ret = OK;
    }

  /* Disable all interrupts */

  esp_i2c_slave_intr_disable(priv);

  return ret;
}

/****************************************************************************
 * Name: esp_i2c_slave_thread
 *
 * Description:
 *   Thread for i2c slave driver in polling mode.
 *
 * Parameter:
 *   argc - Number opf arguments
 *   argv - Pointer to argument list
 *
 * Returned Values:
 *   Zero (OK)
 *
 ****************************************************************************/

static int esp_i2c_slave_thread(int argc, char **argv)
{
  struct esp_i2c_priv_s *priv =
      (struct esp_i2c_priv_s *)((uintptr_t)strtoul(argv[1], NULL, 16));
  int ret;

  nxsched_usleep(1000);
  while (true)
    {
#ifdef CONFIG_PM
      esp_pm_lock_acquire(priv->pm_lock);
#endif
      esp_i2c_slave_polling_waitdone(priv);
#ifdef CONFIG_PM
      esp_pm_lock_release(priv->pm_lock);
#endif

      /* Sleeping thread before checking i2c peripheral */

      nxsched_usleep(100);
    }

  return OK;
}

#endif

/****************************************************************************
 * Name: esp_i2c_process
 *
 * Description:
 *   This routine manages the transfer. It's called after some specific
 *   commands from the I2C controller are executed or in case of errors.
 *   It's responsible for writing/reading operations and transferring data
 *   from/to FIFO.
 *   It's called in the interrupt and polled driven mode.
 *
 * Parameters:
 *   priv   - Pointer to the internal driver state structure.
 *   status - The current interrupt status register.
 *
 * Returned Values:
 *   None
 *
 ****************************************************************************/

static void esp_i2c_process(struct esp_i2c_priv_s *priv,
                                   uint32_t irq_status)
{
  i2c_intr_event_t evt_type = I2C_INTR_EVENT_ERR;
  uint32_t rx_fifo_cnt;
  uint32_t tx_fifo_rem;

  i2c_ll_slave_get_event(priv->ctx->dev, &evt_type);
  if (evt_type == I2C_INTR_EVENT_TRANS_DONE ||
      evt_type == I2C_INTR_EVENT_RXFIFO_FULL)
    {
      i2c_ll_get_rxfifo_cnt(priv->ctx->dev, &rx_fifo_cnt);
      rx_fifo_cnt = MIN(I2C_SLAVE_BUFF_SIZE - priv->rx_length, rx_fifo_cnt);
      i2c_ll_read_rxfifo(priv->ctx->dev, priv->rx_buffer + priv->rx_length,
                         rx_fifo_cnt);
      priv->rx_length += rx_fifo_cnt;

      /* Code closed for temporary time due to upper layer function issues */

