sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_i2c_slave.c
#if 0
      if (priv->cb != NULL)
        {
          priv->cb(priv->cb_arg, I2CS_RX_COMPLETE, rx_fifo_cnt);
        }
#endif
    }
  else if (evt_type == I2C_INTR_EVENT_TXFIFO_EMPTY)
    {
      i2c_ll_get_txfifo_len(priv->ctx->dev, &tx_fifo_rem);
      tx_fifo_rem = MIN(priv->tx_length, tx_fifo_rem);
      if (tx_fifo_rem != 0)
        {
          i2c_ll_write_txfifo(priv->ctx->dev, priv->tx_buffer, tx_fifo_rem);
          memmove(priv->tx_buffer, priv->tx_buffer + tx_fifo_rem,
                  tx_fifo_rem);
        }
      else
        {
          i2c_ll_slave_disable_tx_it(priv->ctx->dev);
        }

      priv->tx_length -= tx_fifo_rem;

      /* Code closed for temporary time due to upper layer function issues */

#if 0
      if (priv->cb != NULL)
        {
          priv->cb(priv->cb_arg, I2CS_TX_COMPLETE, tx_fifo_rem);
        }
#endif
    }
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp_i2cbus_slave_initialize
 *
 * Description:
 *   Initialize the selected I2C port. And return a pointer to an unique
 *   instance of struct i2c_slave_s. This function may be called to obtain
 *   multiple instances of the interface, each of which may be set up with a
 *   different frequency.
 *
 * Parameters:
 *   port - Port number of the I2C interface to be initialized.
 *   addr - Address of the slave device
 *
 * Returned Value:
 *   Pointer to valid I2C device structure is returned on success.
 *   A NULL pointer is returned on failure.
 *
 ****************************************************************************/

struct i2c_slave_s *esp_i2cbus_slave_initialize(int port, int addr)
{
  struct esp_i2c_priv_s *priv;
  int ret;
#ifdef CONFIG_PM
  esp_pm_lock_type_t pm_lock_type = ESP_PM_NO_LIGHT_SLEEP;
#endif

  switch (port)
    {
#ifdef CONFIG_ESPRESSIF_I2C0_SLAVE_MODE
    case ESPRESSIF_I2C0_SLAVE:
      priv = &esp_i2c0_priv;
      break;
#endif
#ifdef CONFIG_ESPRESSIF_I2C1_SLAVE_MODE
    case ESPRESSIF_I2C1_SLAVE:
      priv = &esp_i2c1_priv;
      break;
#endif
    default:
      return NULL;
    }

  nxmutex_lock(&priv->lock);

  if (priv->refs++ != 0)
    {
      nxmutex_unlock(&priv->lock);

      i2cinfo("Returning previously initialized I2C bus. "
              "Handler: %p\n", priv);

      return (struct i2c_slave_s *)priv;
    }

#ifdef CONFIG_PM
#  if SOC_I2C_SUPPORT_RTC
  if (I2C_CLK_SRC_DEFAULT == I2C_CLK_SRC_RC_FAST)
    {
      pm_lock_type = ESP_PM_NO_LIGHT_SLEEP;
    }
#  endif

#  if SOC_I2C_SUPPORT_APB
  if (I2C_CLK_SRC_DEFAULT == I2C_CLK_SRC_APB)
    {
      pm_lock_type = ESP_PM_APB_FREQ_MAX;
    }
#  endif

  ret = esp_pm_lock_create(pm_lock_type,
                           0,
                           i2c_periph_signal[priv->id].module_name,
                           &priv->pm_lock);
  if (ret != OK)
    {
      priv->refs--;
      nxmutex_unlock(&priv->lock);
      i2cerr("Failed to create I2C PM lock."
             "Handler: %p\n", priv);
      return NULL;
    }
#endif

#ifndef CONFIG_I2C_POLLED
  if (priv->cpuint != -ENOMEM)
    {
      /* Disable the previous IRQ */

      up_disable_irq(ESP_SOURCE2IRQ(i2c_periph_signal[priv->id].irq));
      esp_teardown_irq(i2c_periph_signal[priv->id].irq, priv->cpuint);
    }

  priv->cpuint = esp_setup_irq(i2c_periph_signal[priv->id].irq,
                               ESP_IRQ_PRIORITY_DEFAULT,
                               ESP_IRQ_TRIGGER_LEVEL,
                               esp_i2c_slave_irq,
                               priv);
  if (priv->cpuint < 0)
    {
      /* Failed to allocate a CPU interrupt of this type. */

      priv->refs--;
      nxmutex_unlock(&priv->lock);

      return NULL;
    }

  /* Enable the CPU interrupt that is linked to the I2C device. */

  up_enable_irq(ESP_SOURCE2IRQ(i2c_periph_signal[priv->id].irq));
#else
  /* Create thread for polling sensor data */

  snprintf(arg1, 16, "%p", priv);
  argv[0] = arg1;
  argv[1] = NULL;

  ret = kthread_create("esp_i2c_slave_thread",
                       SCHED_PRIORITY_DEFAULT,
                       128,
                       esp_i2c_slave_thread,
                       argv);
  if (ret < 0)
    {
      kmm_free(priv);
      return NULL;
    }

#endif

  priv->addr = addr;
  esp_i2c_slave_init(priv);
  nxmutex_unlock(&priv->lock);

#ifdef CONFIG_I2C_POLLED
  priv->enabled = true;
#endif

  i2cinfo("I2C bus initialized! Handler: %p\n", priv);

  return (struct i2c_slave_s *)priv;
}

/****************************************************************************
 * Name: esp_i2cbus_slave_uninitialize
 *
 * Description:
 *   De-initialize the selected I2C port and power down the device.
 *
 * Parameters:
 *   dev - Device structure as returned by
 *         esp_i2cbus_slave_uninitialize()
 *
 * Returned Value:
 *   OK is returned on success. ERROR is returned when internal reference
 *   count mismatches or dev points to invalid hardware device.
 *
 ****************************************************************************/

int esp_i2cbus_slave_uninitialize(struct i2c_slave_s *dev)
{
  struct esp_i2c_priv_s *priv = (struct esp_i2c_priv_s *)dev;

  DEBUGASSERT(dev);

  if (priv->refs == 0)
    {
      return ERROR;
    }

  nxmutex_lock(&priv->lock);
  if (--priv->refs)
    {
      nxmutex_unlock(&priv->lock);
      return OK;
    }

#ifdef CONFIG_PM
  if (priv->pm_lock != NULL)
    {
      esp_pm_lock_delete(priv->pm_lock);
      priv->pm_lock = NULL;
    }
#endif

#ifndef CONFIG_I2C_POLLED
  up_disable_irq(ESP_SOURCE2IRQ(i2c_periph_signal[priv->id].irq));
  esp_teardown_irq(i2c_periph_signal[priv->id].irq, priv->cpuint);
  priv->cpuint = -ENOMEM;
#endif

#ifdef CONFIG_I2C_POLLED
  priv->enabled = false;
#endif

  esp_i2c_slave_deinit(priv);
  nxmutex_unlock(&priv->lock);

  return OK;
}

#endif /* CONFIG_ESPRESSIF_I2C_PERIPH_SLAVE_MODE */
